
## Plan Result (aat)




<pre><code>Plan: 4 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_subscription.fee_pay_team_payment_subscription
  * azurerm_api_management_subscription.liberata_supplier_payment_subscription
  * azurerm_key_vault_secret.fee_pay_team_payment_subscription_key
  * azurerm_key_vault_secret.liberata_supplier_payment_subscription_key
* Update
  * module.cft_api_mgmt_api.azurerm_api_management_api.api
  * module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.fee_pay_team_payment_subscription will be created
  + resource "azurerm_api_management_subscription" "fee_pay_team_payment_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-stg"
      + display_name        = "Payment API - Fee and Pay DTS Team Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/products/payments"
      + resource_group_name = "cft-aat-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_api_management_subscription.liberata_supplier_payment_subscription will be created
  + resource "azurerm_api_management_subscription" "liberata_supplier_payment_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-stg"
      + display_name        = "Payment API - Liberata Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/products/payments"
      + resource_group_name = "cft-aat-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_key_vault_secret.fee_pay_team_payment_subscription_key will be created
  + resource "azurerm_key_vault_secret" "fee_pay_team_payment_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat"
      + name                    = "fee-pay-team-payment-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.liberata_supplier_payment_subscription_key will be created
  + resource "azurerm_key_vault_secret" "liberata_supplier_payment_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat"
      + name                    = "liberata-cft-apim-payment-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cft_api_mgmt_api.azurerm_api_management_api.api will be updated in-place
  ~ resource "azurerm_api_management_api" "api" {
        id                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/apis/payments-api;rev=1"
        name                  = "payments-api"
      ~ protocols             = [
          + "http",
            # (1 unchanged element hidden)
        ]
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "api_policy" {
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/apis/payments-api"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<inbound>
          - 		<base />
          - 		<choose>
          - 			<when condition="@(context.Request.Certificate == null || context.Request.Certificate.NotAfter < DateTime.Now || context.Request.Certificate.NotBefore > DateTime.Now || !(new string[] {"B1BF8007527F85085D7C4A3DC406A9A6D124D721","13D1848E8B050CE55E4D41A35A60FF4A17E686A6","B1C45E55A1E93AD43A473972CFF490722EEF1E38","B660C97A7CC2734ABD41FBF9F6ADAA61B0C399D4","B9D9E70AC23EAF8EA094F6B59EF77FF77D977CBE","9AF616DC3860C9736BBD20ADAD34AAFD913FD6CA","B49BDDE7818B78058AC7401BE0284A40845031E3","E5F54E7BA2B780E2B1B1FFAC68F801251935BE80","C6E2FBAB5FED58FD86C10A3BD212CF44668FD1A3","7744A2F56BD3B73C0D7FED61309E1C65AF08538C"}.Any(c => c == context.Request.Certificate.Thumbprint)))">
          - 				<return-response>
          - 					<set-status code="403" reason="Invalid client certificate. Please check expiry." />
          - 				</return-response>
          - 			</when>
          - 		</choose>
          - 		<!-- generate totp -->
          - 		<set-variable name="client_id" value="api_gw" />
          - 		<set-variable name="client_secret" value="C5OI566EGMPHT3CC" />
          - 		<set-variable name="one_time_password" value="@{
          + <policies>
          +     <backend>
          +         <base/>
          +     </backend>
          +     <inbound>
          +         <base/>
          +         <choose>
          +             <when condition="@(context.Request.Headers["X-ARR-ClientCertThumbprint"] == null)">
          +                 <return-response>
          +                     <set-status code="401" />
          +                     <set-body>Missing client certificate.</set-body>
          +                 </return-response>
          +             </when>
          +             <when condition="@(!(new string[] {"B1BF8007527F85085D7C4A3DC406A9A6D124D721","13D1848E8B050CE55E4D41A35A60FF4A17E686A6","B1C45E55A1E93AD43A473972CFF490722EEF1E38","B660C97A7CC2734ABD41FBF9F6ADAA61B0C399D4","B9D9E70AC23EAF8EA094F6B59EF77FF77D977CBE","9AF616DC3860C9736BBD20ADAD34AAFD913FD6CA","B49BDDE7818B78058AC7401BE0284A40845031E3","E5F54E7BA2B780E2B1B1FFAC68F801251935BE80","C6E2FBAB5FED58FD86C10A3BD212CF44668FD1A3","7744A2F56BD3B73C0D7FED61309E1C65AF08538C"}.Contains(context.Request.Headers[&quot;X-ARR-ClientCertThumbprint&quot;].First().ToUpperInvariant())))">
          +                 <return-response>
          +                     <set-status code="401" />
          +                     <set-body>Invalid client certificate.</set-body>
          +                 </return-response>
          +             </when>
          +             <when condition="@(context.Request.Certificate == null || context.Request.Certificate.NotAfter < DateTime.Now || context.Request.Certificate.NotBefore > DateTime.Now || !(new string[] {"B1BF8007527F85085D7C4A3DC406A9A6D124D721","13D1848E8B050CE55E4D41A35A60FF4A17E686A6","B1C45E55A1E93AD43A473972CFF490722EEF1E38","B660C97A7CC2734ABD41FBF9F6ADAA61B0C399D4","B9D9E70AC23EAF8EA094F6B59EF77FF77D977CBE","9AF616DC3860C9736BBD20ADAD34AAFD913FD6CA","B49BDDE7818B78058AC7401BE0284A40845031E3","E5F54E7BA2B780E2B1B1FFAC68F801251935BE80","C6E2FBAB5FED58FD86C10A3BD212CF44668FD1A3","7744A2F56BD3B73C0D7FED61309E1C65AF08538C"}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
          +                 <return-response>
          +                     <set-status code="401" />
          +                     <set-body>Invalid client certificate. Please check expiry.</set-body>
          +                 </return-response>
          +             </when>
          +         </choose>
          +         <!-- generate totp -->
          +         <set-variable name="client_id" value="api_gw" />
          +         <set-variable name="client_secret" value="C5OI566EGMPHT3CC" />
          +         <set-variable name="one_time_password" value="@{
                            const string Base32AllowedCharacters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ234567";
                            var bits = "C5OI566EGMPHT3CC".ToUpper().ToCharArray().Select(c => Convert.ToString(Base32AllowedCharacters.IndexOf(c), 2).PadLeft(5, '0')).Aggregate((a, b) => a + b);
                            var secretKeyBytes = Enumerable.Range(0, bits.Length / 8).Select(i => Convert.ToByte(bits.Substring(i * 8, 8), 2)).ToArray();
            
                            var unixTimestamp = (long) (DateTime.UtcNow.Subtract(new DateTime(1970, 1, 1))).TotalSeconds;
                            var timeIndex = unixTimestamp / 30;
                            byte[] challenge = BitConverter.GetBytes(timeIndex);
                            if (BitConverter.IsLittleEndian) {
                                Array.Reverse(challenge);
                            }
            
                            HMACSHA1 hmac = new HMACSHA1(secretKeyBytes);
                            byte[] hash = hmac.ComputeHash(challenge);
                            int offset = hash[19] & 0xf;
                            int truncatedHash = hash[offset] & 0x7f;
                            for (int i = 1; i < 4; i++)
                            {
                                truncatedHash <<= 8;
                                truncatedHash |= hash[offset + i] & 0xff;
                            }
                            truncatedHash %= 1000000;
                            return truncatedHash.ToString("D6");
          -             }" />
          - 		<send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
          - 			<set-url>http://rpe-service-auth-provider-aat.service.core-compute-aat.internal/lease</set-url>
          - 			<set-method>POST</set-method>
          - 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          - 			</set-header>
          - 			<set-body>@{
          -                 return new JObject(
          -                 new JProperty("microservice", (string)context.Variables["client_id"]),
          -                 new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
          -                 ).ToString();
          -                 }</set-body>
          - 		</send-request>
          - 		<set-header name="ServiceAuthorization" exists-action="override">
          - 			<value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As<string>())</value>
          - 		</set-header>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 		<choose>
          - 			<when condition="@(context.Response.StatusCode == 200 || context.Response.StatusCode == 206)">
          - 				<find-and-replace from="giro_slip_no" to="bank_giro_credit_slip_number" />
          - 				<find-and-replace from="volume" to="volume_amount" />
          - 				<find-and-replace from=""reference"" to=""fee_reference"" />
          - 			</when>
          - 		</choose>
          - 	</outbound>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          +             }"/>
          +         <send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
          +             <set-url>http://rpe-service-auth-provider-aat.service.core-compute-aat.internal/lease</set-url>
          +             <set-method>POST</set-method>
          +             <set-header name="Content-Type" exists-action="override">
          +                 <value>application/json</value>
          +             </set-header>
          +             <set-body>@{
          +                 return new JObject(
          +                 new JProperty("microservice", (string)context.Variables["client_id"]),
          +                 new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
          +                 ).ToString();
          +                 }</set-body>
          +         </send-request>
          + 
          +         <set-header name="ServiceAuthorization" exists-action="override">
          +             <value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As<string>())</value>
          +         </set-header>
          +     </inbound>
          +     <outbound>
          +         <base/>
          +         <choose>
          +             <when condition="@(context.Response.StatusCode == 200 || context.Response.StatusCode == 206)">
          +                 <find-and-replace from="giro_slip_no" to="bank_giro_credit_slip_number" />
          +                 <find-and-replace from="volume" to="volume_amount" />
          +                 <find-and-replace from="&quot;reference&quot;" to="&quot;fee_reference&quot;" />
          +             </when>
          +         </choose>
          +     </outbound>
          +     <on-error>
          +         <base/>
          +     </on-error>
            </policies>
        EOT
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":129,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->